# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

#  EfficientNetLite backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, stem, [32, 'ReLU6']],             # 0-P1/2  ch_out, act
   [-1, 1, MBConvBlock_ECA_Shuffle, [16, 3, 1, 1, 0, False, True]],   # 1 ch_out, k_size, s, expand

   [-1, 1, MBConvBlock_ECA_Shuffle, [24, 3, 2, 6, 1, True, True]],   # 2-P2/4 ch_out, k_size, s, expand, drop_connect_rate, se
   [-1, 1, MBConvBlock_ECA_Shuffle, [24, 3, 1, 6, 1, False, True]],

   [-1, 1, MBConvBlock_ECA_Shuffle, [40, 5, 2, 6, 1, False, True]],   # 4-P3/8 ch_out, k_size, s, expand, drop_connect_rate, se
   [-1, 1, MBConvBlock_ECA_Shuffle, [40, 5, 1, 6, 1, False, True]],

   [-1, 1, MBConvBlock_ECA_Shuffle, [80, 3, 2, 6, 1, False, True]],   # 6-P4/16 ch_out, k_size, s, expand, drop_connect_rate, se
   [-1, 1, MBConvBlock_ECA_Shuffle, [80, 3, 1, 6, 1, False, True]],
   [-1, 1, MBConvBlock_ECA_Shuffle, [80, 3, 1, 6, 1, False, True]],
   [-1, 1, MBConvBlock_ECA_Shuffle, [112, 5, 1, 6, 1, False, True]],  # 9
   [-1, 1, MBConvBlock_ECA_Shuffle, [112, 5, 1, 6, 1, False, True]],
   [-1, 1, MBConvBlock_ECA_Shuffle, [112, 5, 1, 6, 1, False, True]],

   [-1, 1, MBConvBlock_ECA_Shuffle, [192, 5, 2, 6, 1, False, True]],  # 12-P5/32 ch_out, k_size, s, expand, drop_connect_rate, se
   [-1, 1, MBConvBlock_ECA_Shuffle, [192, 5, 1, 6, 1, False, True]],
   [-1, 1, MBConvBlock_ECA_Shuffle, [192, 5, 1, 6, 1, False, True]],
   [-1, 1, MBConvBlock_ECA_Shuffle, [192, 5, 1, 6, 1, False, True]],
   [-1, 1, MBConvBlock_ECA_Shuffle, [320, 3, 1, 6, 1, False, True]],  # 16

   [-1, 1, SPPF, [1024, 5]], # 17
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 11], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 21

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 25 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 22], 1, Concat, [1]], # cat head P4
   [-1, 3, C3, [512, False]],  # 28 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 18], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 31 (P5/32-large)

   [[25, 28, 31], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
